In [5]:
import pandas as pd
import numpy as np

In [3]:
# Creation of dataframes in pandas
data={
    "Name":["ali","yasir","sharjeel"],
    "Age":[10,20,30]
}
df=pd.DataFrame(data)
df

       Name  Age
0       ali   10
1     yasir   20
2  sharjeel   30

In [ ]:
# For datasets
data=pd.read_csv("titanic.csv")
data

In [9]:
# Exploring data in pandas  
    # we have to know the complete knowledge regarding data(null val,num val,datatype)
data=pd.read_csv("titanic.csv")
data.info()
data.describe()
data.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   last      891 non-null    object
 1   first     891 non-null    object
 2   gender    891 non-null    object
 3   age       714 non-null    float64
 4   class     891 non-null    int64
 5   fare      891 non-null    float64
 6   embarked  891 non-null    object
 7   survived  891 non-null    object
dtypes: float64(2), int64(1), object(5)
memory usage: 55.8+ KB

last          0
first         0
gender        0
age         177
class         0
fare          0
embarked      0
survived      0
dtype: int64

In [14]:
#Handling Duplicate value in pandas
data=pd.read_csv("titanic.csv")
data.duplicated()
data['age'].duplicated().sum()

# we have to remove the duplicated values from there where we have unique values 

data.drop_duplicates("age")

,last,first,gender,age,class,fare,embarked,survived
0,Braund,Mr. Owen Harris,M,22.00,3,7.2500,Southampton,no
1,Cumings,Mrs. John Bradley (Florence Briggs Thayer),F,38.00,1,71.2833,Cherbourg,yes
2,Heikkinen,Miss Laina,F,26.00,3,7.9250,Southampton,yes
3,Futrelle,Mrs. Jacques Heath (Lily May Peel),F,35.00,1,53.1000,Southampton,yes
5,Moran,Mr. James,M,NaN,3,8.4583,Queenstown,no
...,...,...,...,...,...,...,...,...
755,Hamalainen,Master Viljo,M,0.67,2,14.5000,Southampton,yes
767,Mangan,Miss Mary,F,30.50,3,7.7500,Queenstown,no
803,Thomas,Master Assad Alexander,M,0.42,3,8.5167,Cherbourg,yes
843,Lemberopolous,Mr. Peter L,M,34.50,3,6.4375,Cherbourg,no
851,Svensson,Mr. Johan,M,74.00,3,7.7750,Southampton,no

In [ ]:
#Working with Missing values in Data
data=pd.read_csv("titanic.csv")
data.isnull().sum()
data.dropna()  # here if we do this then we cat see the record because it deletes all the record of user
data.replace(np.nan,"hi") #but it will replace all an with hi so we have to do this
print(data["age"].mean()) #so here we take the mean of age and now we will replace it with the nan value
data["age"]=data["age"].replace(np.nan,29.69)
data

In [22]:
#Agar ma uor ki value necha khali jga pr fill krwana chta ho ya
#  phr necha ki value upr fill krwana chhta to forward and bacword fill ka use kreinga
data.fillna(method="bfill")
data.filna(method="ffill")
data.ffill()

In [5]:
# Coloumns Transformation in Pandas part 1
data=pd.read_csv("titanic.csv")
data.loc[(data["age"]>30),"Junior Employee"]="no bonus" 
data.loc[(data["age"]>40),"Senior Employee"]="1000 bonus"
data.loc[(data["age"]>50),"Most Senior Employee"]="5000 bonus"

print(data)

          last                                       first gender   age  \
0       Braund                             Mr. Owen Harris      M  22.0
1      Cumings  Mrs. John Bradley (Florence Briggs Thayer)      F  38.0
2    Heikkinen                                  Miss Laina      F  26.0
3     Futrelle          Mrs. Jacques Heath (Lily May Peel)      F  35.0
4        Allen                           Mr. William Henry      M  35.0
..         ...                                         ...    ...   ...
886   Montvila                                 Rev. Juozas      M  27.0
887     Graham                         Miss Margaret Edith      F  19.0
888   Johnston               Miss Catherine Helen "Carrie"      F   NaN
889       Behr                             Mr. Karl Howell      M  26.0
890     Dooley                                 Mr. Patrick      M  32.0

     class     fare     embarked survived Junior Employee Senior Employee  \
0        3   7.2500  Southampton       no             NaN             NaN
1        1  71.2833    Cherbourg      yes        no bonus             NaN
2        3   7.9250  Southampton      yes             NaN             NaN
3        1  53.1000  Southampton      yes        no bonus             NaN
4        3   8.0500  Southampton       no        no bonus             NaN
..     ...      ...          ...      ...             ...             ...
886      2  13.0000  Southampton       no             NaN             NaN
887      1  30.0000  Southampton      yes             NaN             NaN
888      3  23.4500  Southampton       no             NaN             NaN
889      1  30.0000    Cherbourg      yes             NaN             NaN
890      3   7.7500   Queenstown       no        no bonus             NaN

    Most Senior Employee
0                    NaN
1                    NaN
2                    NaN
3                    NaN
4                    NaN
..                   ...
886                  NaN
887                  NaN
888                  NaN
889                  NaN
890                  NaN

[891 rows x 11 columns]

In [ ]:
data["Full Nmae"]=data["first"]+data["last"]
data["Full Nmae"]=data["first"].str.capitalize()+data["last"].str.capitalize()

data

In [ ]:
# Coloumns Transformation in Pandas part 2
data=pd.read_csv("Titanic.csv")
data["AVERGAE AGE"]=(data["age"]/100)*20
print(data)

In [8]:
data={"Months":["January","Feburary","March","April"]}
a=pd.DataFrame(data)
a["Short Months"]=a["Months"].str[0:3]  
## There is another way to do this 
def extract(value):
    return value[0:3]
a["Short Months"]=a["Months"].map(extract)
a

     Months Short Months
0   January          Jan
1  Feburary          Feb
2     March          Mar
3     April          Apr

In [28]:
#GroupBy in pandas
 #when we have large data the it will be difficult for us to understand the data so we summarize the data  for summarizing we use groupby

data=pd.read_csv("Titanic.csv")
gp=data.groupby(["age"]).agg({"last":"count"})
gp=data.groupby(["age"]).agg({"first":"count"})
gp=data.groupby(["age","gender"]).agg({"last":"count"})
gp=data.groupby("age").agg({"fare":"max"})
gp=data.groupby("age").agg({"fare":"mean"})
gp=data.groupby(["age","gender"]).agg({"fare":"mean"})
gp=data.groupby(["age","gender"]).agg({"fare":"mean","class":"max"})


gp

                  fare  class
age   gender
0.42  M         8.5167      3
0.67  M        14.5000      2
0.75  F        19.2583      3
0.83  M        23.8750      2
0.92  M       151.5500      1
...                ...    ...
70.00 M        40.7500      2
70.50 M         7.7500      3
71.00 M        42.0792      1
74.00 M         7.7750      3
80.00 M        30.0000      1

[145 rows x 2 columns]

In [36]:
#Merge, join and concatinate in pandas 
data1={"EmpId":["E01","E02","E03","E04"],
       "Names":["Sharry","ali","sharjeel","yasir"],
       "Age":[20,30,25,36]
       }
data2={"EmpId":["E01","E02","E03","E04","E04"],
       "Salary":[15000,25000,30000,35000,45000]
       }
df1=pd.DataFrame(data1)
df2=pd.DataFrame(data2)
df1
df2

pd.merge(df1,df2,on="EmpId")

#Merge will only work on common values like if we do this
data3={"EmpId":["E01","E02","E03","E04"],
       "Names":["Sharry","ali","sharjeel","yasir"],
       "Age":[20,30,25,36]
       }
data4={"EmpId":["E01","E07","E03","E04","E04"],
       "Salary":[15000,25000,30000,35000,45000]
       }
df3=pd.DataFrame(data3)
df4=pd.DataFrame(data4)
pd.merge(df1,df2,on="EmpId")  #so here it will not print E02 because the E02 exist in df3 but not in df4

  EmpId     Names  Age  Salary
0   E01    Sharry   20   15000
1   E02       ali   30   25000
2   E03  sharjeel   25   30000
3   E04     yasir   36   35000
4   E04     yasir   36   45000

In [41]:
#so if we wantt to shiw all data of a table so we use join
a=pd.merge(df3,df4,on="EmpId",how="left")
# we can also specify left and right
b=pd.merge(left=df3,right=df4,on="EmpId",how="left")
b=pd.merge(left=df3,right=df4,on="EmpId",how="right")
b

  EmpId     Names   Age  Salary
0   E01    Sharry  20.0   15000
1   E07       NaN   NaN   25000
2   E03  sharjeel  25.0   30000
3   E04     yasir  36.0   35000
4   E04     yasir  36.0   45000

In [46]:
data5={"EmpId":["E01","E02","E03","E04"],
       "Names":["Sharry","ali","sharjeel","yasir"],
       "Age":[20,30,25,36]
       }
data6={"EmpId":["E05","E06","E07","E08"],
       "Names":["S","a","s","y"],
       "Age":[2,3,2,3]
       }
df5=pd.DataFrame(data5)
df6=pd.DataFrame(data6)
df5
df6

f=pd.concat([df5,df6])
f

  EmpId     Names  Age
0   E01    Sharry   20
1   E02       ali   30
2   E03  sharjeel   25
3   E04     yasir   36
0   E05         S    2
1   E06         a    3
2   E07         s    2
3   E08         y    3

In [7]:
# Pandas/ Compare Dataframes
dict1={"Fruits":["mango","apples","banana","papaya"],
      "price":[100,150,50,35],
      "quantity":[15,20,40,50]}
df1=pd.DataFrame(dict1)

df2=df1.copy()
df2.loc[0,"price"]=120
df2.loc[1,"price"]=170
df2.loc[2,"price"]=190
df2.loc[0,"quantity"]=20

df1.compare(df2)
df1.compare(df2,align_axis=0)
df1.compare(df2,keep_equal=True)
df1.compare(df2,keep_shape=True)

  price       quantity
   self other     self other
0   100   120       15    20
1   150   170       20    20
2    50   190       40    40

In [6]:
#Pivoting and Melting DataFrames
#Pivoting:

dict={"Keys":["k1","k2","k1","k2"],
      "Names":["john","sharry","david","peter"],
      "Houses":["red","blue","green","red"],
      "grades":[10,20,30,40]}         
df=pd.DataFrame(dict)
pivot_df = df.pivot(index="Keys", columns="Names", values="Houses")
pivot_df = df.pivot(index="Keys", columns="Names", values=["Houses","grades"])

pivot_df

      Houses                   grades
Names  david john peter sharry  david john peter sharry
Keys
k1     green  red   NaN    NaN     30   10   NaN    NaN
k2       NaN  NaN   red   blue    NaN  NaN    40     20

In [12]:
#Melting
dict={
      "Names":["john","sharry","david","peter"],
      "Houses":["red","blue","green","red"],
      "grades":[10,20,30,40]}  
df=pd.DataFrame(dict)
a=pd.melt(df,id_vars=["Names"],value_vars=["Houses","grades"],var_name="Houses&grades",value_name="sharry")
a

    Names Houses&grades sharry
0    john        Houses    red
1  sharry        Houses   blue
2   david        Houses  green
3   peter        Houses    red
4    john        grades     10
5  sharry        grades     20
6   david        grades     30
7   peter        grades     40